app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 10
SELECT 1 AS one FROM "comments" WHERE "comments"."post_id" = 10 LIMIT 1
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 11
---
        <h3 style="font-family: Arial, sans-serif; font-size: 1.2rem; margin-top: 20px;">Comentários:</h3>
        <% if post.comments.any? %>
          <% post.comments.each do |comment| %>