app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 9
---
<h2>Comentários</h2>
<% @post.comments.each do |comment| %>