app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES ('dsadasd', 1, 7, '2024-11-17 23:03:28.877402', '2024-11-17 23:03:28.877402') RETURNING "id"
---
  def create
    @comment = @post.comments.build(comment_params)
    @comment.user = current_user
    if @comment.save

DELETE FROM "posts" WHERE "posts"."id" = 4
DELETE FROM "comments" WHERE "comments"."id" = 5
---
  def delete_comment
    if @comment.user == current_user || @post.user == current_user
      @comment.destroy

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 7 AND "comments"."id" = 5 LIMIT 1
---
  def set_comment
    @comment = @post.comments.find(params[:id])