app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ('Fodase?', 'dsads', 1, '2024-11-18 05:02:44.549115', '2024-11-18 05:02:44.549115') RETURNING "id"
---
  def create
    @post = current_user.posts.build(post_params)
    if @post.save